micropython/micropython/stmhal/hal/src/stm32f2xx_hal_cryp.c
  /* Call output data transfer complete callback */
  HAL_CRYP_OutCpltCallback(hcryp);
}

/**
  * @brief  DMA CRYP communication error callback. 
  * @param  hdma: DMA handle
  * @retval None
  */
static void CRYP_DMAError(DMA_HandleTypeDef *hdma)
{
  CRYP_HandleTypeDef* hcryp = (CRYP_HandleTypeDef*)((DMA_HandleTypeDef*)hdma)->Parent;
  hcryp->State= HAL_CRYP_STATE_READY;
  HAL_CRYP_ErrorCallback(hcryp);
}

/**
  * @brief  Writes the Key in Key registers. 
  * @param  hcryp: CRYP handle
  * @param  Key: Pointer to Key buffer
  * @param  KeySize: Size of Key
  * @retval None
  */
static void CRYP_SetKey(CRYP_HandleTypeDef *hcryp, uint8_t *Key, uint32_t KeySize)
{
  uint32_t keyaddr = (uint32_t)Key;
  
  switch(KeySize)
  {
  case CRYP_KEYSIZE_256B:
    /* Key Initialisation */
    CRYP->K0LR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K0RR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K1LR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K1RR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K2LR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K2RR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K3LR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K3RR = __REV(*(uint32_t*)(keyaddr));
    break;
  case CRYP_KEYSIZE_192B:
    CRYP->K1LR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K1RR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K2LR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K2RR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K3LR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K3RR = __REV(*(uint32_t*)(keyaddr));
    break;
  case CRYP_KEYSIZE_128B:       
    CRYP->K2LR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K2RR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K3LR = __REV(*(uint32_t*)(keyaddr));
    keyaddr+=4;
    CRYP->K3RR = __REV(*(uint32_t*)(keyaddr));
    break;
  default:
    break;
  }
}

/**
  * @brief  Writes the InitVector/InitCounter in IV registers. 
  * @param  hcryp: CRYP handle
  * @param  InitVector: Pointer to InitVector/InitCounter buffer
  * @param  IVSize: Size of the InitVector/InitCounter
  * @retval None
  */
static void CRYP_SetInitVector(CRYP_HandleTypeDef *hcryp, uint8_t *InitVector, uint32_t IVSize)
{
  uint32_t ivaddr = (uint32_t)InitVector;
  
  switch(IVSize)
  {
  case CRYP_KEYSIZE_128B:
    CRYP->IV0LR = __REV(*(uint32_t*)(ivaddr));
    ivaddr+=4;
    CRYP->IV0RR = __REV(*(uint32_t*)(ivaddr));
    ivaddr+=4;
    CRYP->IV1LR = __REV(*(uint32_t*)(ivaddr));
    ivaddr+=4;
    CRYP->IV1RR = __REV(*(uint32_t*)(ivaddr));
    break;
    /* Whatever key size 192 or 256, Init vector is written in IV0LR and IV0RR */
  case CRYP_KEYSIZE_192B:
    CRYP->IV0LR = __REV(*(uint32_t*)(ivaddr));
    ivaddr+=4;
    CRYP->IV0RR = __REV(*(uint32_t*)(ivaddr));
    break;
  case CRYP_KEYSIZE_256B:
    CRYP->IV0LR = __REV(*(uint32_t*)(ivaddr));
    ivaddr+=4;
    CRYP->IV0RR = __REV(*(uint32_t*)(ivaddr));
    break;
  default:
    break;
  }
}

/**
  * @brief  Process Data: Writes Input data in polling mode and read the output data
  * @param  hcryp: CRYP handle
  * @param  Input: Pointer to the Input buffer
  * @param  Ilength: Length of the Input buffer, must be a multiple of 16.
  * @param  Output: Pointer to the returned buffer
  * @retval None
  */
static HAL_StatusTypeDef CRYP_ProcessData(CRYP_HandleTypeDef *hcryp, uint8_t* Input, uint16_t Ilength, uint8_t* Output, uint32_t Timeout)
{
  uint32_t timeout = 0;
  
  uint32_t i = 0;
  uint32_t inputaddr  = (uint32_t)Input;
  uint32_t outputaddr = (uint32_t)Output;
  
  for(i=0; (i < Ilength); i+=16)
  {
    /* Write the Input block in the IN FIFO */
    CRYP->DR = *(uint32_t*)(inputaddr);
    inputaddr+=4;
    CRYP->DR = *(uint32_t*)(inputaddr);
    inputaddr+=4;
    CRYP->DR  = *(uint32_t*)(inputaddr);
    inputaddr+=4;
    CRYP->DR = *(uint32_t*)(inputaddr);
    inputaddr+=4;
    
    /* Get timeout */
    timeout = HAL_GetTick() + Timeout;

    while(HAL_IS_BIT_CLR(CRYP->SR, CRYP_FLAG_OFNE))
    {    
      /* Check for the Timeout */
      if(Timeout != HAL_MAX_DELAY)
      {
        if(HAL_GetTick() >= timeout)
        {
          /* Change state */
          hcryp->State = HAL_CRYP_STATE_TIMEOUT;
          
          /* Process Unlocked */          
          __HAL_UNLOCK(hcryp);
        
          return HAL_TIMEOUT;
        }
      }
    }
    /* Read the Output block from the Output FIFO */
    *(uint32_t*)(outputaddr) = CRYP->DOUT;
    outputaddr+=4;
    *(uint32_t*)(outputaddr) = CRYP->DOUT;
    outputaddr+=4;
    *(uint32_t*)(outputaddr) = CRYP->DOUT;
    outputaddr+=4;
    *(uint32_t*)(outputaddr) = CRYP->DOUT;
    outputaddr+=4;
  }
  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Process Data: Write Input data in polling mode. 
  * @param  hcryp: CRYP handle
  * @param  Input: Pointer to the Input buffer
  * @param  Ilength: Length of the Input buffer, must be a multiple of 8
  * @param  Output: Pointer to the returned buffer
  * @param  Timeout: Specify Timeout value  
  * @retval None
  */
static HAL_StatusTypeDef CRYP_ProcessData2Words(CRYP_HandleTypeDef *hcryp, uint8_t* Input, uint16_t Ilength, uint8_t* Output, uint32_t Timeout)
{
  uint32_t timeout = 0;   
  
  uint32_t i = 0;
  uint32_t inputaddr  = (uint32_t)Input;
  uint32_t outputaddr = (uint32_t)Output;
  
  for(i=0; (i < Ilength); i+=8)
  {
    /* Write the Input block in the IN FIFO */
    CRYP->DR  = *(uint32_t*)(inputaddr);
    inputaddr+=4;
    CRYP->DR = *(uint32_t*)(inputaddr);
    inputaddr+=4;
    
    /* Get timeout */
    timeout = HAL_GetTick() + Timeout;
    
    while(HAL_IS_BIT_CLR(CRYP->SR, CRYP_FLAG_OFNE))
    {
      /* Check for the Timeout */
      if(Timeout != HAL_MAX_DELAY)
      {
        if(HAL_GetTick() >= timeout)
        {
          /* Change state */
          hcryp->State = HAL_CRYP_STATE_TIMEOUT;
          
          /* Process Unlocked */          
          __HAL_UNLOCK(hcryp);
          
